app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "lowell.mower@gmail.com"]]
---
  def user_create
    user = User.find_by(username: user_params[:username])

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."username" = $1 LIMIT 1  [["username", "lowell.mower@gmail.com"]]
---
  def vendor_create
    vendor = Vendor.find_by(username: vendor_params[:username])